In [8]:
import pandas as pd

In [9]:
data = {
    "name" : ['jay','noob','yash'],
    "age" : [20,18,20]
}

In [10]:
data

{'name': ['jay', 'noob', 'yash'], 'age': [20, 18, 20]}

In [11]:
df =pd.DataFrame(data)

In [12]:
df

   name  age
0   jay   20
1  noob   18
2  yash   20

In [13]:
df.shape

(3, 2)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [15]:
#df.head(1)
df.head() #prints first 5 rows

   name  age
0   jay   20
1  noob   18
2  yash   20

In [16]:
#df.tail(1)
df.tail() #prints last 5 rows

   name  age
0   jay   20
1  noob   18
2  yash   20

In [17]:
df.dtypes

name    object
age      int64
dtype: object

In [24]:
df.to_csv('raw-data-2-csv.csv',index=False)
#df.to_csv('raw-data-2-csv.csv') #make csv  with serial no./indexing

In [25]:
read=pd.read_csv('raw-data-2-csv.csv')

In [26]:
read

   name  age
0   jay   20
1  noob   18
2  yash   20

In [32]:
#read['name'] #read[0:3]
#read[['name','age']] #double/2D lists to print columns/parameters with more then 1 call

   name  age
0   jay   20
1  noob   18